In [1]:
#Pandas -- Data Analysis Library
# 1. Used extensively by Data Scientist/Data Analyst to perform EDA (Exploratory Data Analysis)
# EDA is all about getting comfortable with the data such that you can answer any type of question
# raised by your stakeholders / client

In [2]:
import numpy as np
import pandas as pd

In [3]:
# The core data abstraction layer in Pandas is called a DataFrame
# Any data that you load/initialize using Pandas will be represented in the form of DataFrame
# To create a Dataframe, you can use the following two approach
# 1. Create DF using collection object (list)
# 2. Create DF by loading a file

In [4]:
#Example using list

list1 = [[1,'Prashant',1000], [2,'Arun',2000]]

empDataFrameFromList = pd.DataFrame(list1)
empDataFrameFromList

   0         1     2
0  1  Prashant  1000
1  2      Arun  2000

In [5]:
# DataFrame data is represented using Row and Column indexes
# You can replace Column indexes with column names

empDataFrameFromList.columns = ['eid','ename','esal']
empDataFrameFromList

   eid     ename  esal
0    1  Prashant  1000
1    2      Arun  2000

In [6]:
#Variation 2:
list2 = [[1,'Prashant',5000], [2,'Arun',8000], [3,'Aman',9899]]

empDataFrameFromList2 = pd.DataFrame(list2 , columns=['empid','ename','esal'])
empDataFrameFromList2

   empid     ename  esal
0      1  Prashant  5000
1      2      Arun  8000
2      3      Aman  9899

In [7]:
# Create DataFrame by File
# LOad a delimited file --> Any file which has a column seperator character.
# e.g. CSV (Comma Seperated Values), TSV (Tab Seperated Values) etc.

employeeDataFrame = pd.read_csv("data\employee.csv", header=None, names=['eid','ename','esal'])
employeeDataFrame

   eid     ename  esal
0    1  Prashant  1000
1    2      Amar  2000
2    3    Chitra  2000
3    4  Utkarsha  9878
4    5      Ajit  9999

In [8]:
?pd.read_csv

In [9]:
empWithHeaderDF = pd.read_csv("data\employeeWithHeaders.csv", sep=',')
empWithHeaderDF

   eid     ename  esal
0    1  Prashant  1000
1    2      Amar  2000
2    3    Chitra  2000
3    3    Chitra  2000
4    4  Utkarsha  9878
5    5      Ajit  9999

In [10]:
#Load the data from remote path 
irisFromRemote = pd.read_csv("https://raw.githubusercontent.com/uiuc-cse/data-fa14/gh-pages/data/iris.csv")
irisFromRemote.head(5)

URLError: <urlopen error [Errno 11001] getaddrinfo failed>

In [ ]:
irisFromRemote.tail(5)

# Series vs DataFrame

In [11]:
empWithHeaderDF = pd.read_csv("data\employeeWithHeaders.csv", sep=',')
empWithHeaderDF

   eid     ename  esal
0    1  Prashant  1000
1    2      Amar  2000
2    3    Chitra  2000
3    3    Chitra  2000
4    4  Utkarsha  9878
5    5      Ajit  9999

In [12]:
#To get the information of the dataframe
empWithHeaderDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     6 non-null      int64
 1   ename   6 non-null      object
 2   esal    6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [13]:
type(empWithHeaderDF)

pandas.core.frame.DataFrame

In [14]:
# Series in Pandas
# Seriees is a column.Very similar to Numpy Array with dimension (X,1)
# A set of Series forms a DataFrame

In [15]:
empWithHeaderDF.esal

0    1000
1    2000
2    2000
3    2000
4    9878
5    9999
Name: esal, dtype: int64

In [16]:
type(empWithHeaderDF.esal)

pandas.core.series.Series

In [17]:
# You can convert the DataFrame/Series into a Numpy Array

empArray = empWithHeaderDF.values #.values convert DF into Numpy Array
print(type(empArray))
empArray

<class 'numpy.ndarray'>

array([[1, 'Prashant', 1000],
       [2, 'Amar', 2000],
       [3, 'Chitra', 2000],
       [3, 'Chitra', 2000],
       [4, 'Utkarsha', 9878],
       [5, 'Ajit', 9999]], dtype=object)

In [18]:
# Even reverse is possible
pd.DataFrame(empArray , columns=['eid','ename','esal'])

  eid     ename  esal
0   1  Prashant  1000
1   2      Amar  2000
2   3    Chitra  2000
3   3    Chitra  2000
4   4  Utkarsha  9878
5   5      Ajit  9999

# Operations in Series

In [19]:
empWithHeaderDF = pd.read_csv("data\employeeWithHeaders.csv", sep=',')
empWithHeaderDF

   eid     ename  esal
0    1  Prashant  1000
1    2      Amar  2000
2    3    Chitra  2000
3    3    Chitra  2000
4    4  Utkarsha  9878
5    5      Ajit  9999

In [20]:
#Use-case: I want to calculate the yearlySalary of the employee and add a new column called yearlySalary

yearlySalary = empWithHeaderDF.esal * 12
yearlySalary

0     12000
1     24000
2     24000
3     24000
4    118536
5    119988
Name: esal, dtype: int64

In [21]:
type(yearlySalary)

pandas.core.series.Series

In [23]:
type(empWithHeaderDF.esal)

pandas.core.series.Series

In [24]:
#Pandas Dataframes are mutable in nature

empWithHeaderDF['yearlySalary'] = yearlySalary
empWithHeaderDF

   eid     ename  esal  yearlySalary
0    1  Prashant  1000         12000
1    2      Amar  2000         24000
2    3    Chitra  2000         24000
3    3    Chitra  2000         24000
4    4  Utkarsha  9878        118536
5    5      Ajit  9999        119988

In [25]:
# Add a new column using a collection object

deptList = ['HR','Ops','','','Ops','HR']

# Convert the collection object into series
# Technique -- Load the collection as series

deptSeries = pd.Series(deptList)
deptSeries

0     HR
1    Ops
2
3
4    Ops
5     HR
dtype: object

In [26]:

#Add Series in dataFrame
empWithHeaderDF['department'] = deptSeries
empWithHeaderDF

   eid     ename  esal  yearlySalary department
0    1  Prashant  1000         12000         HR
1    2      Amar  2000         24000        Ops
2    3    Chitra  2000         24000
3    3    Chitra  2000         24000
4    4  Utkarsha  9878        118536        Ops
5    5      Ajit  9999        119988         HR

In [ ]:
# Use-case: I want to create a new column called UpdatedYearlySalary based on the following increment/hike conditions
# If the salary is less than equal to 1500, then inc the sal by 10%
# If the salary is between 1501 and 10000, then inc the sal by 5%
# If the salary is between 10001 and 20000, then inc the sal by 2.5%
# If the salary is greater than 20000 , then no inc

In [ ]:
# Pandas recommends to create a Function that can implement the logic
# and use apply method to implement function in a series

In [27]:
def incrementSalary(salary):
    newSal = 0
    
    if salary <= 1500:
        newSal = salary * 1.1
    elif salary <= 10000:
        newSal = salary * 1.05
    elif salary <= 20000:
        newSal = salary * 1.025
    else:
        newSal = salary
    
    return newSal

In [28]:
empWithHeaderDF['UpdatedYearlySalary'] = empWithHeaderDF.esal.apply(incrementSalary) * 12
empWithHeaderDF

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000                         25200.0
3    3    Chitra  2000         24000                         25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [29]:
empWithHeaderDF.department = pd.Series(['HR','Ops','Admin','Admin','Ops','HR'])
empWithHeaderDF

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [30]:
#Store the dataframe into a file
empWithHeaderDF.to_csv('FinalOutput.csv' , index=False)

#  Traversing the DataFrame

In [64]:
datasetExample = pd.read_csv('FinalOutput.csv')
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [32]:
# first 3 records 
# ename,dept,UpdatedSalary
datasetExample.iloc[ 0:3 , [1,4,5]]

      ename department  UpdatedYearlySalary
0  Prashant         HR              13200.0
1      Amar        Ops              25200.0
2    Chitra      Admin              25200.0

In [33]:
# first 3 records 
# UpdatedSalary,ename,dept
datasetExample.iloc[ 0:3 , [5,1,4]]

   UpdatedYearlySalary     ename department
0              13200.0  Prashant         HR
1              25200.0      Amar        Ops
2              25200.0    Chitra      Admin

In [34]:
# Data Traversal
# Type1 -- Traversing the data using Index
#
# iloc --> indexLocation
# iloc[rowIndex/rowRange/rowList , columnIndex/columnRange/columnList]


datasetExample.iloc[ 0:3 , :]

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0

In [35]:
datasetExample.iloc[ 0:3 , 0:4]

   eid     ename  esal  yearlySalary
0    1  Prashant  1000         12000
1    2      Amar  2000         24000
2    3    Chitra  2000         24000

In [36]:
datasetExample.iloc[ 0:3 , [0,4] ]

   eid department
0    1         HR
1    2        Ops
2    3      Admin

In [37]:
#datasetExample = pd.read_csv('FinalOutput.csv')
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [38]:
#1. Extract the records of employees whose esal is greater than 5000

datasetExample[ datasetExample.esal > 5000 ]

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [39]:
#2.Extract the records of employees whose esal is equal 2000
datasetExample[datasetExample.esal == 2000]

   eid   ename  esal  yearlySalary department  UpdatedYearlySalary
1    2    Amar  2000         24000        Ops              25200.0
2    3  Chitra  2000         24000      Admin              25200.0
3    3  Chitra  2000         24000      Admin              25200.0

In [40]:
#3. Extract only ename and department of employees whose esal is greater than 2000
datasetExample[datasetExample.esal > 2000].iloc[0:3,[1,4]]

      ename department
4  Utkarsha        Ops
5      Ajit         HR

In [41]:
#3. Extract only ename and department of employees whose esal is greater than 5000
datasetExample[ datasetExample.esal > 5000 ].iloc[:,[1,4]]

      ename department
4  Utkarsha        Ops
5      Ajit         HR

In [44]:
#3. Extract those records whose sal is greater than 6500 and belongs to Ops dept
datasetExample[(datasetExample.esal > 6500) & (datasetExample.department == 'Ops')]

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
4    4  Utkarsha  9878        118536        Ops             124462.8

In [51]:
#4. Display the name of employees whose salary is greater than 6500 and belongs to HR dept
datasetExample[(datasetExample.esal > 6500) & (datasetExample.department == 'HR')].ename

5    Ajit
Name: ename, dtype: object

In [53]:
datasetExample[(datasetExample.esal > 6500) & (datasetExample.department == 'HR')].iloc[:,[1]]

  ename
5  Ajit

In [54]:
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [ ]:
# Replace the salary of the employee as 7000 if the current salary is less than 1500
# assignment

In [74]:
 datasetExample[datasetExample.esal< 1500]

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0

In [69]:
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

# Operation 2 - Dealing with Duplicate Rows

In [75]:
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [76]:
datasetExample.drop_duplicates(inplace = True)

In [77]:
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [ ]:
# The major demerit of DropDuplicate is the index is never reset automatically which may impact the
# fetch cycle of the data when performing EDA or Statistical Modelling.
# So the best practice is to reset the index as soon as DropDuplicate is performed

# Operation 3: Performing Merge Operations iN Pandas

In [78]:
dfExample1 = pd.DataFrame([[4,'QA'],[1,'HR'],[3,'Dev'],[2,'Ops']] , columns=['eid','dept'])

In [79]:
dfExample1

   eid dept
0    4   QA
1    1   HR
2    3  Dev
3    2  Ops

In [80]:
dfExample2 = pd.DataFrame([[1,'Prashant'],[2,'Gokul'],[3,'Guna']] , columns=['eid','ename'])

In [81]:
dfExample2

   eid     ename
0    1  Prashant
1    2     Gokul
2    3      Guna

In [82]:
# Use-case. I want to perform Join operation of two dfs based on eid
# We will use merge
resultDF = pd.merge(dfExample2,dfExample1)
resultDF
# The merge worked in this case because both dataframe have the common column eid
# that too with the same name

   eid     ename dept
0    1  Prashant   HR
1    2     Gokul  Ops
2    3      Guna  Dev

In [83]:
dept = pd.DataFrame([[4,'QA'],[1,'HR'],[3,'Dev'],[2,'Ops']] , columns=['eid','dept'])
emp = pd.DataFrame([[1,'Prashant'],[2,'Gokul'],[3,'Guna']] , columns=['empid','ename'])

In [84]:
dept

   eid dept
0    4   QA
1    1   HR
2    3  Dev
3    2  Ops

In [85]:
emp

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna

In [86]:
# Use-case. I want to perform Join operation of two dfs based on empid and eid resp.
resultDF2 = pd.merge(emp,dept ,left_on='empid', right_on='eid' )
resultDF2

   empid     ename  eid dept
0      1  Prashant    1   HR
1      2     Gokul    2  Ops
2      3      Guna    3  Dev

In [87]:
finalAnswer = resultDF2.iloc[:,[0,1,3]]

In [88]:
finalAnswer

   empid     ename dept
0      1  Prashant   HR
1      2     Gokul  Ops
2      3      Guna  Dev

In [89]:
resultDF2 = pd.merge(emp,dept ,left_on='empid', right_on='eid')
resultDF2

   empid     ename  eid dept
0      1  Prashant    1   HR
1      2     Gokul    2  Ops
2      3      Guna    3  Dev

In [90]:
finalAnswer2 = resultDF2.iloc[:,[0,1,3]]
finalAnswer2

   empid     ename dept
0      1  Prashant   HR
1      2     Gokul  Ops
2      3      Guna  Dev

# Operation 4 - Concat Operation

In [92]:
empExample = pd.DataFrame([[1,'Prashant'],[2,'Gokul'],[3,'Guna']] , columns=['empid','ename'])

In [93]:
empExample2 = pd.DataFrame([[4,'Nik'],[5,'Ashish'],[6,'Asha']] , columns=['empid','ename'])

In [94]:
empExample

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna

In [95]:
empExample2

   empid   ename
0      4     Nik
1      5  Ashish
2      6    Asha

In [96]:
#Rowwise Concatenation --- Ensure the column names are same in all DFs.
resultEmp = pd.concat( [empExample,empExample2] , axis = 0)
resultEmp

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna
0      4       Nik
1      5    Ashish
2      6      Asha

In [97]:
empExample3 = pd.DataFrame([[4,'Nik'],[5,'Ashish'],[6,'Asha']] , columns=['empid','empname'])
empExample3.columns = ['empid','ename']
resultEmp2 = pd.concat( [empExample,empExample3] , axis = 0)
resultEmp2

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna
0      4       Nik
1      5    Ashish
2      6      Asha

In [98]:
#Columnwise Concat
empExample = pd.DataFrame([[1,'Prashant'],[2,'Gokul'],[3,'Guna']] , columns=['empid','ename'])
dept = pd.DataFrame([['Mumbai','QA'],['Chennai','HR'],['Bangalore','Dev']] , columns=['ecity','dept'])

In [99]:
empExample

   empid     ename
0      1  Prashant
1      2     Gokul
2      3      Guna

In [100]:
dept

       ecity dept
0     Mumbai   QA
1    Chennai   HR
2  Bangalore  Dev

In [101]:
#Columnwise Concatenation --- Ensure the Row Indexes are same in all DFs.
resultEmp3 = pd.concat( [empExample,dept] , axis = 1)
resultEmp3

   empid     ename      ecity dept
0      1  Prashant     Mumbai   QA
1      2     Gokul    Chennai   HR
2      3      Guna  Bangalore  Dev

# Operation 6 --- Deletion

In [102]:
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [107]:
#Column Deletion (axis = 1) ---> UpdatedYearlySalary

datasetExample.drop(['UpdatedYearlySalary'] , axis = 1 , inplace=True)

In [108]:
datasetExample

   eid     ename  esal  yearlySalary department
0    1  Prashant  1000         12000         HR
1    2      Amar  2000         24000        Ops
2    3    Chitra  2000         24000      Admin
4    4  Utkarsha  9878        118536        Ops
5    5      Ajit  9999        119988         HR

In [109]:
#Row Deletion (axis=0)
datasetExample.drop([5] , axis=0, inplace=True)

In [110]:
datasetExample

   eid     ename  esal  yearlySalary department
0    1  Prashant  1000         12000         HR
1    2      Amar  2000         24000        Ops
2    3    Chitra  2000         24000      Admin
4    4  Utkarsha  9878        118536        Ops

In [111]:
datasetExample.drop( datasetExample[datasetExample.eid == 3].index , axis=0)

   eid     ename  esal  yearlySalary department
0    1  Prashant  1000         12000         HR
1    2      Amar  2000         24000        Ops
4    4  Utkarsha  9878        118536        Ops

In [112]:
datasetExample.iloc[:,3:6].index

Int64Index([0, 1, 2, 4], dtype='int64')

In [ ]:
# Replace the salary of the employee as 7000 if the current salary is less than 1500
# assignment

In [129]:
datasetExample

   eid     ename  esal  yearlySalary department
0    1  Prashant  7000         12000         HR
1    2      Amar  2000         24000        Ops
2    3    Chitra  2000         24000      Admin
4    4  Utkarsha  9878        118536        Ops

In [ ]:
sr.update(pd.Series([5000, 6000], index = [4, 6]))

In [121]:
datasetExample.loc[0, 'esal']=7000

In [135]:
datasetExample.loc[1,'esal']=4000

In [136]:
datasetExample

   eid     ename  esal  yearlySalary department
0    1  Prashant  7000         12000         HR
1    2      Amar  4000         24000        Ops
2    3    Chitra  2000         24000      Admin
4    4  Utkarsha  9878        118536        Ops